wyniki_10G_article/fio_results_btrfs_nvme/block_size_65536/lab-sec-2/fio_database_article_test_output.txt
database_article_test: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=128
fio-3.36
Starting 1 process
database_article_test: Laying out IO file (1 file / 10240MiB)

database_article_test: (groupid=0, jobs=1): err= 0: pid=58774: Sun Apr 20 21:17:47 2025
  read: IOPS=25.4k, BW=199MiB/s (208MB/s)(34.9GiB/180001msec)
    slat (usec): min=2, max=61838, avg=12.68, stdev=96.81
    clat (usec): min=67, max=2140.0k, avg=2862.04, stdev=8126.71
     lat (usec): min=74, max=2140.1k, avg=2874.72, stdev=8130.05
    clat percentiles (usec):
     |  1.00th=[  498],  5.00th=[ 1074], 10.00th=[ 1319], 20.00th=[ 1500],
     | 30.00th=[ 1729], 40.00th=[ 1975], 50.00th=[ 2278], 60.00th=[ 2606],
     | 70.00th=[ 3064], 80.00th=[ 3687], 90.00th=[ 4752], 95.00th=[ 6128],
     | 99.00th=[10159], 99.50th=[13698], 99.90th=[27919], 99.95th=[33817],
     | 99.99th=[54789]
   bw (  KiB/s): min=  192, max=332464, per=99.93%, avg=203222.10, stdev=59189.15, samples=359
   iops        : min=   24, max=41558, avg=25402.77, stdev=7398.65, samples=359
  write: IOPS=25.4k, BW=199MiB/s (208MB/s)(34.9GiB/180001msec); 0 zone resets
    slat (usec): min=5, max=43589, avg=14.53, stdev=90.17
    clat (usec): min=69, max=2391.8k, avg=2145.44, stdev=8952.49
     lat (usec): min=78, max=2391.9k, avg=2159.97, stdev=8954.42
    clat percentiles (usec):
     |  1.00th=[  586],  5.00th=[  766], 10.00th=[  873], 20.00th=[ 1057],
     | 30.00th=[ 1237], 40.00th=[ 1369], 50.00th=[ 1516], 60.00th=[ 1745],
     | 70.00th=[ 2057], 80.00th=[ 2540], 90.00th=[ 3425], 95.00th=[ 5276],
     | 99.00th=[ 9241], 99.50th=[13829], 99.90th=[28705], 99.95th=[34866],
     | 99.99th=[88605]
   bw (  KiB/s): min=  192, max=332704, per=99.94%, avg=203149.32, stdev=59061.40, samples=359
   iops        : min=   24, max=41588, avg=25393.66, stdev=7382.68, samples=359
  lat (usec)   : 100=0.01%, 250=0.13%, 500=0.64%, 750=2.53%, 1000=7.21%
  lat (msec)   : 2=44.00%, 4=33.31%, 10=11.24%, 20=0.71%, 50=0.21%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%, >=2000=0.01%
  cpu          : usr=7.98%, sys=52.93%, ctx=2321121, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=4575514,4573728,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=199MiB/s (208MB/s), 199MiB/s-199MiB/s (208MB/s-208MB/s), io=34.9GiB (37.5GB), run=180001-180001msec
  WRITE: bw=199MiB/s (208MB/s), 199MiB/s-199MiB/s (208MB/s-208MB/s), io=34.9GiB (37.5GB), run=180001-180001msec